fun main() {
//    print("Ввкдите порядковый номер месяца (1 до 12): ")
//    val indx = readln().toInt()
//    var month =when(indx) {
//        1 -> "январь"
//        2 -> "февраль"
//        3 -> "март"
//        4 -> "апрель"
//        5 -> "май"
//        6 -> "июнь"
//        7 -> "июль"
//        8 -> "август"
//        9 -> "сентябрь"
//        10 -> "октябрь"
//        11 -> "ноябрь"
//        12 -> "декабрь"
//        else -> "отсутвует месяц"
//    }
//    if (indx in 1..12) { println("Ваш индекс $indx соответствует месяцу $month")
//
//    }
  }

